<%@ page language="java" import="java.io.PrintWriter"
	pageEncoding="utf-8"%>
<%
		
	String cacheID = request.getParameter("cacheID");
	StringBuilder result = new StringBuilder();
	StringBuilder data = new StringBuilder();
	String s1=request.getParameter("s1")==null?"infomen":request.getParameter("s1");
		String dataaa="[{\"asyn\":0,\"id\":\"00360000000000000000\",\"orderby\":999999,\"pid\":\"0\",\"val\":\"中国移动通信集团湖南有限公司\"},{\"asyn\":0,\"id\":\"00360072000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"信息系统部\"},{\"asyn\":0,\"id\":\"XIAJIA^00360072000000000000\",\"orderby\":999999,\"pid\":\"00360072000000000000\",\"val\":\"夏达\"}]";
		String databb="[{\"asyn\":0,\"id\":\"00360000000000000000\",\"orderby\":999999,\"pid\":\"0\",\"val\":\"中国移动通信集团湖南有限公司\"},{\"asyn\":0,\"id\":\"00360072000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"信息系统部\"},{\"asyn\":0,\"id\":\"00360072000100000000\",\"orderby\":999999,\"pid\":\"00360072000000000000\",\"val\":\"技术支持\"},{\"asyn\":0,\"id\":\"VGOP^00360072000100000000\",\"orderby\":999999,\"pid\":\"00360072000100000000\",\"val\":\"ABC厂商\"},{\"asyn\":0,\"id\":\"VGOP^0036007211000100000000\",\"orderby\":999999,\"pid\":\"00360072000100000000\",\"val\":\"FDG厂商\"}]";
		
		
		String aa="[{\"asyn\":0,\"id\":\"00360000000000000000\",\"orderby\":999999,\"pid\":\"0\",\"val\":\"中国移动通信集团湖南有限公司\"},{\"asyn\":0,\"id\":\"00360072000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"信息系统部\"},{\"asyn\":0,\"id\":\"YANGHONG^00360072000000000000\",\"orderby\":999999,\"pid\":\"00360072000000000000\",\"val\":\"刘叁\"}]";
		
		String bb="[]";

		
	String cc="[{\"asyn\":0,\"id\":\"00360000000000000000\",\"orderby\":999999,\"pid\":\"0\",\"val\":\"中国移动通信集团湖南有限公司\"},{\"asyn\":0,\"id\":\"00360057000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"计划部\"},{\"asyn\":0,\"id\":\"LIXIANG^00360057000000000000\",\"orderby\":999999,\"pid\":\"00360057000000000000\",\"val\":\"李四\"},{\"asyn\":0,\"id\":\"LONGNANPING^00360057000000000000\",\"orderby\":999999,\"pid\":\"00360057000000000000\",\"val\":\"龙发的\"},{\"asyn\":0,\"id\":\"ZHUREN^00360057000000000000\",\"orderby\":999999,\"pid\":\"00360057000000000000\",\"val\":\"朱百合\"},{\"asyn\":0,\"id\":\"DINGTAO^00360057000000000000\",\"orderby\":999999,\"pid\":\"00360057000000000000\",\"val\":\"丁涛\"},{\"asyn\":0,\"id\":\"00360060000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"纪检组、监察室\"},{\"asyn\":0,\"id\":\"WANGHEQING^00360060000000000000\",\"orderby\":999999,\"pid\":\"00360060000000000000\",\"val\":\"王清多\"},{\"asyn\":0,\"id\":\"00360068000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"集团客户部\"},{\"asyn\":0,\"id\":\"TANBENJUN^00360068000000000000\",\"orderby\":999999,\"pid\":\"00360068000000000000\",\"val\":\"谭阿杜\"},{\"asyn\":0,\"id\":\"SHENYONG^00360068000000000000\",\"orderby\":999999,\"pid\":\"00360068000000000000\",\"val\":\"沈桂花\"},{\"asyn\":0,\"id\":\"LIZHENGHUI^00360068000000000000\",\"orderby\":999999,\"pid\":\"00360068000000000000\",\"val\":\"李图尔\"},{\"asyn\":0,\"id\":\"00360071000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"客户服务部\"},{\"asyn\":0,\"id\":\"OUCHENG^00360071000000000000\",\"orderby\":999999,\"pid\":\"00360071000000000000\",\"val\":\"欧格登\"},{\"asyn\":0,\"id\":\"JIANGZHIHENG^00360071000000000000\",\"orderby\":999999,\"pid\":\"00360071000000000000\",\"val\":\"蒋光武\"},{\"asyn\":0,\"id\":\"00360054000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"网络部\"},{\"asyn\":0,\"id\":\"YANGQUNLIN^00360054000000000000\",\"orderby\":999999,\"pid\":\"00360054000000000000\",\"val\":\"杨酷锐\"},{\"asyn\":0,\"id\":\"YANGZHAOJUN^00360054000000000000\",\"orderby\":999999,\"pid\":\"00360054000000000000\",\"val\":\"杨佳人\"},{\"asyn\":0,\"id\":\"ZHANGWEIHAO^00360054000000000000\",\"orderby\":999999,\"pid\":\"00360054000000000000\",\"val\":\"张高和\"},{\"asyn\":0,\"id\":\"00360076000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"安全保卫部\"},{\"asyn\":0,\"id\":\"CHENJIANZHONG^00360076000000000000\",\"orderby\":999999,\"pid\":\"00360076000000000000\",\"val\":\"陈俊\"},{\"asyn\":0,\"id\":\"WANGQIAOSHAN^00360076000000000000\",\"orderby\":999999,\"pid\":\"00360076000000000000\",\"val\":\"王家\"},{\"asyn\":0,\"id\":\"00360051000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"综合部、发展战略部\"},{\"asyn\":0,\"id\":\"YANGXINCHUN^00360051000000000000\",\"orderby\":999999,\"pid\":\"00360051000000000000\",\"val\":\"杨杰\"},{\"asyn\":0,\"id\":\"00360059000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"工会\"},{\"asyn\":0,\"id\":\"WANGGENGSHENG^00360059000000000000\",\"orderby\":999999,\"pid\":\"00360059000000000000\",\"val\":\"王娥\"},{\"asyn\":0,\"id\":\"SHENYOUSHAN^00360059000000000000\",\"orderby\":999999,\"pid\":\"00360059000000000000\",\"val\":\"沈撒娥\"},{\"asyn\":0,\"id\":\"JIANGRUOLIN^00360059000000000000\",\"orderby\":999999,\"pid\":\"00360059000000000000\",\"val\":\"蒋树富\"},{\"asyn\":0,\"id\":\"00360062000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"后勤服务中心\"},{\"asyn\":0,\"id\":\"JIANGSHAOQUAN^00360062000000000000\",\"orderby\":999999,\"pid\":\"00360062000000000000\",\"val\":\"姜和\"},{\"asyn\":0,\"id\":\"ZHANGXIAOGUANG^00360062000000000000\",\"orderby\":999999,\"pid\":\"00360062000000000000\",\"val\":\"张愿望\"},{\"asyn\":0,\"id\":\"YILUSHAN^00360062000000000000\",\"orderby\":999999,\"pid\":\"00360062000000000000\",\"val\":\"易韩文\"},{\"asyn\":0,\"id\":\"00360068000000650000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"网管中心\"},{\"asyn\":0,\"id\":\"ZHANGYUEMING^00360068000000650000\",\"orderby\":999999,\"pid\":\"00360068000000650000\",\"val\":\"张一如\"},{\"asyn\":0,\"id\":\"LIUWEIWEI^00360068000000650000\",\"orderby\":999999,\"pid\":\"00360068000000650000\",\"val\":\"刘欧尔\"},{\"asyn\":0,\"id\":\"00360056000000000000\",\"orderby\":999999,\"pid\":\"00360000000000000000\",\"val\":\"数据部\"},{\"asyn\":0,\"id\":\"HUGUOLAN^00360056000000000000\",\"orderby\":999999,\"pid\":\"00360056000000000000\",\"val\":\"胡上发\"}]";
		
if( s1.equals("theDeptHeader"))
data.append(aa);
else if( s1.equals("End"))
data.append(bb);
else if( s1.equals("relatedBusinessDeptHeader"))
data.append(cc);
else
data.append(aa);
	
	result.append("[");
	result.append("{");
	result.append("cacheID:\"" + cacheID + "\",");
	result.append("cacheData:" + data.toString());
	result.append("}");
	result.append("]");
	PrintWriter pw = response.getWriter();
	pw.print(data.toString());
	
%>
